; domain
(define (domain satellite)
  (:requirements :typing :fluents :equality)
 (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:functions (data_capacity ?s - satellite)
	      (data ?d - direction ?m - mode)
		(slew_time ?a ?b - direction)
		(data-stored)
		(fuel ?s - satellite)
		(fuel-used)
  )

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
		(>= (fuel ?s) (slew_time ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
		(decrease (fuel ?s) (slew_time ?d_new ?d_prev))
		(increase (fuel-used) (slew_time ?d_new ?d_prev))
           )
  )

 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )
 

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
			  (>= (data_capacity ?s) (data ?d ?m))
               )
   :effect (and (decrease (data_capacity ?s) (data ?d ?m)) (have_image ?d ?m)
		(increase (data-stored) (data ?d ?m)))
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	thermograph1 - mode
	thermograph3 - mode
	infrared2 - mode
	infrared0 - mode
	GroundStation1 - direction
	GroundStation2 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	Star0 - direction
	Star5 - direction
	Planet6 - direction
	Phenomenon7 - direction
	Star8 - direction
	Phenomenon9 - direction
)
(:init
	(supports instrument0 infrared2)
	(supports instrument0 infrared0)
	(supports instrument0 thermograph3)
	(calibration_target instrument0 GroundStation4)
	(supports instrument1 infrared0)
	(supports instrument1 infrared2)
	(supports instrument1 thermograph3)
	(calibration_target instrument1 Star0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation4)
	(= (data_capacity satellite0) 1000)
	(= (fuel satellite0) 182)
	(= (data Star5 thermograph1) 107)
	(= (data Planet6 thermograph1) 284)
	(= (data Phenomenon7 thermograph1) 227)
	(= (data Star8 thermograph1) 128)
	(= (data Phenomenon9 thermograph1) 7)
	(= (data Star5 thermograph3) 171)
	(= (data Planet6 thermograph3) 166)
	(= (data Phenomenon7 thermograph3) 273)
	(= (data Star8 thermograph3) 262)
	(= (data Phenomenon9 thermograph3) 274)
	(= (data Star5 infrared2) 108)
	(= (data Planet6 infrared2) 235)
	(= (data Phenomenon7 infrared2) 133)
	(= (data Star8 infrared2) 78)
	(= (data Phenomenon9 infrared2) 146)
	(= (data Star5 infrared0) 184)
	(= (data Planet6 infrared0) 229)
	(= (data Phenomenon7 infrared0) 271)
	(= (data Star8 infrared0) 100)
	(= (data Phenomenon9 infrared0) 257)
	(= (slew_time GroundStation1 Star0) 31.4)
	(= (slew_time Star0 GroundStation1) 31.4)
	(= (slew_time GroundStation2 Star0) 32.83)
	(= (slew_time Star0 GroundStation2) 32.83)
	(= (slew_time GroundStation2 GroundStation1) 13.84)
	(= (slew_time GroundStation1 GroundStation2) 13.84)
	(= (slew_time GroundStation3 Star0) 27.17)
	(= (slew_time Star0 GroundStation3) 27.17)
	(= (slew_time GroundStation3 GroundStation1) 79.14)
	(= (slew_time GroundStation1 GroundStation3) 79.14)
	(= (slew_time GroundStation3 GroundStation2) 12.92)
	(= (slew_time GroundStation2 GroundStation3) 12.92)
	(= (slew_time GroundStation4 Star0) 7.996)
	(= (slew_time Star0 GroundStation4) 7.996)
	(= (slew_time GroundStation4 GroundStation1) 27.89)
	(= (slew_time GroundStation1 GroundStation4) 27.89)
	(= (slew_time GroundStation4 GroundStation2) 76.99)
	(= (slew_time GroundStation2 GroundStation4) 76.99)
	(= (slew_time GroundStation4 GroundStation3) 47.47)
	(= (slew_time GroundStation3 GroundStation4) 47.47)
	(= (slew_time Star5 Star0) 81.64)
	(= (slew_time Star0 Star5) 81.64)
	(= (slew_time Star5 GroundStation1) 69.94)
	(= (slew_time GroundStation1 Star5) 69.94)
	(= (slew_time Star5 GroundStation2) 52.3)
	(= (slew_time GroundStation2 Star5) 52.3)
	(= (slew_time Star5 GroundStation3) 20.74)
	(= (slew_time GroundStation3 Star5) 20.74)
	(= (slew_time Star5 GroundStation4) 46.73)
	(= (slew_time GroundStation4 Star5) 46.73)
	(= (slew_time Planet6 Star0) 44.11)
	(= (slew_time Star0 Planet6) 44.11)
	(= (slew_time Planet6 GroundStation1) 28.61)
	(= (slew_time GroundStation1 Planet6) 28.61)
	(= (slew_time Planet6 GroundStation2) 16.01)
	(= (slew_time GroundStation2 Planet6) 16.01)
	(= (slew_time Planet6 GroundStation3) 3.511)
	(= (slew_time GroundStation3 Planet6) 3.511)
	(= (slew_time Planet6 GroundStation4) 74.39)
	(= (slew_time GroundStation4 Planet6) 74.39)
	(= (slew_time Planet6 Star5) 40.02)
	(= (slew_time Star5 Planet6) 40.02)
	(= (slew_time Phenomenon7 Star0) 4.571)
	(= (slew_time Star0 Phenomenon7) 4.571)
	(= (slew_time Phenomenon7 GroundStation1) 1.832)
	(= (slew_time GroundStation1 Phenomenon7) 1.832)
	(= (slew_time Phenomenon7 GroundStation2) 57.85)
	(= (slew_time GroundStation2 Phenomenon7) 57.85)
	(= (slew_time Phenomenon7 GroundStation3) 52.31)
	(= (slew_time GroundStation3 Phenomenon7) 52.31)
	(= (slew_time Phenomenon7 GroundStation4) 28.3)
	(= (slew_time GroundStation4 Phenomenon7) 28.3)
	(= (slew_time Phenomenon7 Star5) 88.07)
	(= (slew_time Star5 Phenomenon7) 88.07)
	(= (slew_time Phenomenon7 Planet6) 23.36)
	(= (slew_time Planet6 Phenomenon7) 23.36)
	(= (slew_time Star8 Star0) 12.31)
	(= (slew_time Star0 Star8) 12.31)
	(= (slew_time Star8 GroundStation1) 16.39)
	(= (slew_time GroundStation1 Star8) 16.39)
	(= (slew_time Star8 GroundStation2) 48.99)
	(= (slew_time GroundStation2 Star8) 48.99)
	(= (slew_time Star8 GroundStation3) 27.35)
	(= (slew_time GroundStation3 Star8) 27.35)
	(= (slew_time Star8 GroundStation4) 40.52)
	(= (slew_time GroundStation4 Star8) 40.52)
	(= (slew_time Star8 Star5) 49.73)
	(= (slew_time Star5 Star8) 49.73)
	(= (slew_time Star8 Planet6) 9.785)
	(= (slew_time Planet6 Star8) 9.785)
	(= (slew_time Star8 Phenomenon7) 10.04)
	(= (slew_time Phenomenon7 Star8) 10.04)
	(= (slew_time Phenomenon9 Star0) 24.17)
	(= (slew_time Star0 Phenomenon9) 24.17)
	(= (slew_time Phenomenon9 GroundStation1) 9.741)
	(= (slew_time GroundStation1 Phenomenon9) 9.741)
	(= (slew_time Phenomenon9 GroundStation2) 26.62)
	(= (slew_time GroundStation2 Phenomenon9) 26.62)
	(= (slew_time Phenomenon9 GroundStation3) 13.74)
	(= (slew_time GroundStation3 Phenomenon9) 13.74)
	(= (slew_time Phenomenon9 GroundStation4) 19.47)
	(= (slew_time GroundStation4 Phenomenon9) 19.47)
	(= (slew_time Phenomenon9 Star5) 70.64)
	(= (slew_time Star5 Phenomenon9) 70.64)
	(= (slew_time Phenomenon9 Planet6) 28.43)
	(= (slew_time Planet6 Phenomenon9) 28.43)
	(= (slew_time Phenomenon9 Phenomenon7) 5.269)
	(= (slew_time Phenomenon7 Phenomenon9) 5.269)
	(= (slew_time Phenomenon9 Star8) 11.38)
	(= (slew_time Star8 Phenomenon9) 11.38)
	(= (data-stored) 0)
	(= (fuel-used) 0)
)
(:goal (and
	(have_image Star5 infrared2)
	(have_image Planet6 infrared2)
	(have_image Star8 infrared0)
	(have_image Phenomenon9 thermograph3)
))
(:metric minimize (fuel-used))

)

; plan
1. (turn_to satellite0 phenomenon7 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 phenomenon7)
   changed: (fuel satellite0) from 182 to 153.7, (fuel-used) from 0 to 28.3
   goals met: 0 of 4
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 4
3. (turn_to satellite0 planet6 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 planet6)
   changed: (fuel satellite0) from 153.7 to 130.34, (fuel-used) from 28.3 to 51.66
   goals met: 0 of 4
4. (turn_to satellite0 groundstation3 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 groundstation3)
   changed: (fuel satellite0) from 130.34 to 126.829, (fuel-used) from 51.66 to 55.171
   goals met: 0 of 4
5. (turn_to satellite0 planet6 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 planet6)
   changed: (fuel satellite0) from 126.829 to 123.318, (fuel-used) from 55.171 to 58.682
   goals met: 0 of 4
6. (turn_to satellite0 groundstation3 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 groundstation3)
   changed: (fuel satellite0) from 123.318 to 119.807, (fuel-used) from 58.682 to 62.193
   goals met: 0 of 4
7. (turn_to satellite0 planet6 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 planet6)
   changed: (fuel satellite0) from 119.807 to 116.296, (fuel-used) from 62.193 to 65.704
   goals met: 0 of 4
8. (turn_to satellite0 star8 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 star8)
   changed: (fuel satellite0) from 116.296 to 106.511, (fuel-used) from 65.704 to 75.489
   goals met: 0 of 4
9. (turn_to satellite0 phenomenon9 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 phenomenon9)
   changed: (fuel satellite0) from 106.511 to 95.131, (fuel-used) from 75.489 to 86.869
   goals met: 0 of 4
10. (turn_to satellite0 phenomenon7 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 phenomenon7)
   changed: (fuel satellite0) from 95.131 to 89.862, (fuel-used) from 86.869 to 92.138
   goals met: 0 of 4
11. (turn_to satellite0 phenomenon9 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 phenomenon9)
   changed: (fuel satellite0) from 89.862 to 84.593, (fuel-used) from 92.138 to 97.407
   goals met: 0 of 4
12. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 0 of 4
13. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 4
14. (turn_to satellite0 phenomenon7 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 phenomenon7)
   changed: (fuel satellite0) from 84.593 to 79.324, (fuel-used) from 97.407 to 102.676
   goals met: 0 of 4
15. (turn_to satellite0 star0 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 star0)
   changed: (fuel satellite0) from 79.324 to 74.753, (fuel-used) from 102.676 to 107.247
   goals met: 0 of 4
16. (calibrate satellite0 instrument1 star0)
   added: (calibrated instrument1)
   goals met: 0 of 4
17. (turn_to satellite0 star8 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 star8)
   changed: (fuel satellite0) from 74.753 to 62.443, (fuel-used) from 107.247 to 119.557
   goals met: 0 of 4
18. (take_image satellite0 star8 instrument1 infrared0)
   added: (have_image star8 infrared0)
   changed: (data_capacity satellite0) from 1000 to 900, (data-stored) from 0 to 100
   goals met: 1 of 4
19. (turn_to satellite0 planet6 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 planet6)
   changed: (fuel satellite0) from 62.443 to 52.658, (fuel-used) from 119.557 to 129.342
   goals met: 1 of 4
20. (take_image satellite0 planet6 instrument1 infrared2)
   added: (have_image planet6 infrared2)
   changed: (data_capacity satellite0) from 900 to 665, (data-stored) from 100 to 335
   goals met: 2 of 4
21. (turn_to satellite0 groundstation3 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 groundstation3)
   changed: (fuel satellite0) from 52.658 to 49.147, (fuel-used) from 129.342 to 132.853
   goals met: 2 of 4
22. (turn_to satellite0 phenomenon9 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 phenomenon9)
   changed: (fuel satellite0) from 49.147 to 35.407, (fuel-used) from 132.853 to 146.593
   goals met: 2 of 4
23. (take_image satellite0 phenomenon9 instrument1 thermograph3)
   added: (have_image phenomenon9 thermograph3)
   changed: (data_capacity satellite0) from 665 to 391, (data-stored) from 335 to 609
   goals met: 3 of 4
24. (turn_to satellite0 groundstation3 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 groundstation3)
   changed: (fuel satellite0) from 35.407 to 21.667, (fuel-used) from 146.593 to 160.333
   goals met: 3 of 4
25. (turn_to satellite0 star5 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 star5)
   changed: (fuel satellite0) from 21.667 to 0.927, (fuel-used) from 160.333 to 181.073
   goals met: 3 of 4
26. (take_image satellite0 star5 instrument1 infrared2)
   added: (have_image star5 infrared2)
   changed: (data_capacity satellite0) from 391 to 283, (data-stored) from 609 to 717
   goals met: 4 of 4
